<h1>Конвертация русскоязычных доменов</h1>
<p>Кодировка Punycode используется в системе Многоязычных доменных имен (IDNA) и является ASCII совместимым кодом ACE. Она необходима для работы многоязычных доменов в существующей системе DNS. Система IDNA позволяет использовать в качестве имени домена национальный алфавит.
<p>В отличие от обычного доменного имени, например, google.com или bname.ru, многоязычное доменное имя записывается полностью или частично на языке, отличном от английского. Например, домены.com и президент.орг. Видимое в поисковых системах и в браузере доменное имя «страна.рф» в кодировке Punycode выглядит так: «xn--80aa2bkeg.xn--p1ai».
<p>Инструмент Конвертация в Punycode преобразует любую введенную строку или текст в кодировку Punycode. Возможна прямая и обратная конвертация. Для кодирования / декодирования списка доменов разделяйте каждый домен переводом строки (по одному на строку).
<p><form method='post'>
<div align=center><table border=0 cellspacing=0 cellpadding=10 width=80%>
	<tr valign=middle>
		<td align=right>
			<textarea name=encode><?=$_REQUEST['encode']?></textarea>
		</td>
		<td width=1>
			<input type=submit name=submit value='>>>>'>
			<p><input type=submit name=submit value='<<<<'>
		</td>
		<td>
			<textarea name=decode><?=$_REQUEST['decode']?></textarea>
		</td>
	</tr>
</table></div>
</form>
